#include <ADuC7026.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "definitions.h"
//------------------------------------------------------------------------------
//Παράθυρο
//------------------------------------------------------------------------------																				
/*Αρχικοποίηση παραθύρου-Χρησιμοποιείται το παράθυρο Hamming*/
void initwindow(void)
{
int i;
double k=0;
for (i=0;i<COL;i++)
{
k=(2*pi*i)/COL;
Window[i]=0.54-(0.46*(cos(k)));		//Hamming
}   
return ;
}

//------------------------------------------------------------------------------
